---
name: Object
theme:
lang: JS
title: Object
---

```js
// Инициализатор объекта или литерал
{ [ nameValuePair1[, nameValuePair2[, ...nameValuePairN] ] ] }

// Вызов в качестве конструктора
new Object([value])
```

## Параметры

**`nameValuePair1, nameValuePair2, ... nameValuePairN`**

: Пары из имён (строки) и значений (любые значения), где имя отделяется от значения двоеточием.

**`value`**

Любое значение.

---

## Свойства

**`Object.length`**

: Имеет значение `1`.

**`Object.prototype`**

: Позволяет добавлять свойства ко всем объектам типа `Object`.

## Статические методы

**`Object.assign()`**

: Создаёт новый объект путём копирования значений всех собственных перечислимых свойств из одного или более исходных объектов в целевой объект.

**`Object.create()`**

: Создаёт новый объект с указанными объектом прототипа и свойствами.

**`Object.defineProperty()`**

: Добавляет к объекту именованное свойство, описываемое переданным дескриптором.

**`Object.defineProperties()`**

: Добавляет к объекту именованные свойства, описываемые переданными дескрипторами.

**`Object.freeze()`**

: Замораживает объект: другой код не сможет удалить или изменить никакое свойство.

**`Object.getOwnPropertyDescriptor()`**

: Возвращает дескриптор свойства для именованного свойства объекта.

**`Object.getOwnPropertyNames()`**

: Возвращает массив, содержащий имена всех переданных объекту собственных перечисляемых и неперечисляемых свойств.

**`Object.getOwnPropertySymbols()`**

: Возвращает массив всех символьных свойств, найденных непосредственно в переданом объекте.

**`Object.getPrototypeOf()`**

: Возвращает прототип указанного объекта.

**`Object.is()`**

: Определяет, являются ли два значения различимыми (то есть, одинаковыми)

**`Object.isExtensible()`**

: Определяет, разрешено ли расширение объекта.

**`Object.isFrozen()`**

: Определяет, был ли объект заморожен.

**`Object.isSealed()`**

: Определяет, является ли объект запечатанным (sealed).

**`Object.keys()`**

: Возвращает массив, содержащий имена всех собственных перечислимых свойств переданного объекта.

**`Object.observe()`**

: Асинхронно наблюдает за изменениями в объекте.

**`Object.preventExtensions()`**

: Предотвращает любое расширение объекта.

**`Object.seal()`**

: Предотвращает удаление свойств объекта другим кодом.

**`Object.setPrototypeOf()`**

: Устанавливает прототип (т.е. внутреннее свойство `[[Prototype]]`)

## Свойства экземпляра

**`Object.prototype.constructor`**

: Определяет функцию, создающую прототип объекта.

**`Object.prototype.__proto__`**

: Указывает на объект, который использовался в качестве прототипа при инстанцировании объекта.

**`Object.prototype.__noSuchMethod__`**

: Позволяет определить функцию, выполняющуюся при вызове в качестве метода не определённого члена объекта.

## Методы экземпляра

**`Object.prototype.hasOwnProperty()`**

: Возвращает логическое значение, указывающее, содержит ли указанное свойство непосредственно объект, или он унаследовал его по цепочке прототипов.

**`Object.prototype.isPrototypeOf()`**

: Возвращает логическое значение, указывающее, состоит ли указанный объект в цепочке прототипов объекта, на котором был вызван данный метод.

**`Object.prototype.propertyIsEnumerable()`**

: Возвращает логическое значение, указывающее, установлен ли внутренний атрибут ECMAScript `DontEnum`.

**`Object.prototype.toSource()`**

: Возвращает строку, содержащую исходный код объекта в литеральной форме, представляющего объект, на котором был вызван данный метод; вы можете использовать это значение для создания нового объекта.

**`Object.prototype.toLocaleString()`**

: Вызывает `toString()`.

**`Object.prototype.toString()`**

: Возвращает строковое представление объекта.

**`Object.prototype.unwatch()`**

: Удаляет точку наблюдения (watchpoint) со свойства объекта.

**`Object.prototype.valueOf()`**

: Возвращает значение примитива указанного объекта.

**`Object.prototype.watch()`**

: Добавляет точку наблюдения (watchpoint) к свойству объекта.

---

Следующий пример сохраняет пустой объект `Object` в переменную o:

```js
var o = new Object();
var o = new Object(undefined);
var o = new Object(null);
```

Следующий пример сохраняет объекты `Boolean` в переменную o:

```js
// эквивалентно o = new Boolean(true);
var o = new Object(true);
// эквивалентно o = new Boolean(false);
var o = new Object(Boolean());
```

---

- [Object](https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object)
