---
name: a
theme:
lang: HTML
title: a
---

```html
<a
  download="имя файла"
  href="адрес"
  hreflang="код языка"
  rel="отношение"
  target="целевое окно"
  type="MIME-тип"
>
  Текст ссылки
</a>
```

---

Тег **`<a>`** предназначен для создания ссылок.

## Атрибуты

`download`

: Предлагает скачать указанный по ссылке файл.

`href`

: Задаёт адрес документа, на который следует перейти.

`hreflang`

: Идентифицирует язык текста по ссылке.

`ping`

: Этот атрибут уведомляет указанные в нём URL, что пользователь перешёл по ссылке.

`referrerpolicy`

: Этот атрибут сообщает, какую информацию передавать ресурсу по ссылке

`rel`

: Отношения между ссылаемым и текущим документами.

`target`

: Имя окна или фрейма, куда браузер будет загружать документ.

`type`

: Указывает MIME-тип документа, на который ведёт ссылка.

---

```html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>А</title>
  </head>
  <body>
    <p><a href="image/xxx.jpg">Посмотрите на мою фотографию!</a></p>
    <p><a href="page/tip.html">Как сделать такое же фото?</a></p>
  </body>
</html>
```

---

- [`a`](https://developer.mozilla.org/ru/docs/Web/HTML/Element/A)
