---
name: parse
theme: Date
lang: JS
title: Date.parse()
---

```js
Date.parse(dateString); // Прямой вызов
new Date(dateString); // Неявный вызов в конструкторе
```

---

Метод **`Date.parse()`** разбирает строковое представление даты и возвращает количество миллисекунд, прошедших с 1 января 1970 года 00:00:00 по UTC.

## Параметры

**`dateString`**

: Строковое представление даты из RFC2822 (на английском, на русском) или ISO 8601. Могут использоваться и другие форматы, но результаты в таком случае будут непредсказуемые.

---

Если переменная `IPOdate` содержит существующий объект `Date`, она может быть установлена в 9 августа 1995 года (по местному времени) следующим способом:

```js
IPOdate.setTime(Date.parse("Aug 9, 1995"));
```

Вернёт `807926400000` вне зависимости от местного часового пояса, поскольку предоставлен спецификатор GMT (всемирное координированное время).

```js
Date.parse("Wed, 09 Aug 1995 00:00:00 GMT");
```

Вернёт `0` вне зависимости от местного часового пояса, поскольку предоставлен спецификатор GMT (всемирное координированное время).

```js
Date.parse("Thu, 01 Jan 1970 00:00:00 GMT");
```

---

- [Date.parse()](https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Date/parse)
